run/icoPhaseChangeVoF/testMarangoni/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          icoPhaseChangeVoF;

startFrom       startTime;

startTime       0;

stopAt          endTime;
//stopAt          nextWrite;

endTime         0.25;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   0.005;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDiCo         1000000.0;

maxDeltaT       5e-5;


// ************************************************************************* //

DebugSwitches
{
    MULES           1;
}

OptimisationSwitches
{
    fileHandler collated;
}

functions
{
    divU
    {
        type            div;
        libs            ("libfieldFunctionObjects.so");

        writeControl    writeTime;
        writeFields     false;
        regionType      all;

        result          divU;

        field           phi;
    }

    maxValue
    {
        type            volFieldValue;

        libs            ("libfieldFunctionObjects.so");

        log             true;

        writeControl    timeStep;

        writeFields     false;

        regionType      all;

        cellZone        all;

        operation       max;

        fields (p_rgh T divU);
    }

    minValue
    {
        type            volFieldValue;

        libs            ("libfieldFunctionObjects.so");

        log             true;

        writeControl    timeStep;

        writeFields     false;

        regionType      all;

        cellZone        all;

        operation       min;

        fields (p_rgh T divU);
    }

    maxMagValue
    {
        type            volFieldValue;

        libs            ("libfieldFunctionObjects.so");

        log             true;

        writeControl    timeStep;

        writeFields     false;

        regionType      all;

        cellZone        all;

        operation       maxMag;

        fields (U);
    }

    lineUniform
    {
        type            sets;

        libs            ("libsampling.so");

        writeControl    writeTime;

        interpolationScheme cellPoint;

        setFormat       raw;

        fields          (alpha.water);

        sets
        (
            left
            {
                type            lineUniform;
                axis            distance;
                start           (1e-7 0.0 5e-5);
                end             (1e-7 5e-4 5e-5);
                nPoints         120;
            }

            right
            {
                type            lineUniform;
                axis            distance;
                start           (0.9999e-3 0.0 5e-5);
                end             (0.9999e-3 5e-4 5e-5);
                nPoints         120;
            }
        );
    }
}